* DONE Name: "gannet"
  CLOSED: [2015-01-01 Thu 12:34]
* DONE Add tests
  CLOSED: [2014-12-30 Tue 01:27]
* TODO Add extended tests
** include clippings with unicode in them
** include handle corrupt records
*** records with 1 to 6 lines
*** bad dividers
*** bad info lines
*** bad title lines
*** no ending divider
* Clean up code
  CLOCK: [2014-12-29 Mon 23:52]--[2014-12-30 Tue 00:57] =>  1:05
  CLOCK: [2014-12-21 Sun 23:52]--[2014-12-21 Sun 23:54] =>  0:02
  CLOCK: [2014-12-21 Sun 23:30]--[2014-12-21 Sun 23:42] =>  0:12
** TODO namespace title_line_parser
** TODO namespace info_line_parser
** DONE come up with a better name for the 'title' and 'info' record parts
   CLOSED: [2014-12-30 Tue 01:26]
   CLOCK: [2014-12-30 Tue 01:00]--[2014-12-30 Tue 01:26] =>  0:26
   - title_line   = book_information_line
   - info_line    = note_information_line
   - content_line = note_contents_line
** TODO Move BOM detection and .strip to a "string cleanup" function
* Clean up JSON output
  CLOCK: [2014-12-21 Sun 23:51]--[2014-12-21 Sun 23:52] =>  0:01
** Singular or plural for 'author'?
   - authors
   CLOCK: [2014-12-21 Sun 23:42]--[2014-12-21 Sun 23:43] =>  0:01
** singular or plural for location?
   - location_range
   - page_range
** Location and page numbers should be integers
** Don't print a key if it has no value
* See if I can add progressive/unbuffered output of json
* Investigate the uses of org-mode for literate programming
* Tests:
  https://github.com/fmap/clippings/tree/master/tests/fixtures
  https://github.com/ferrouswheel/kclip
  https://github.com/HereChen/KindleClippingsExport
* Other sites:
  http://www.claybavor.com/clipper/faq.php
